In [1]:
import pandas as pd
import pandasql as ps

In [2]:
mak = pd.read_csv('map_article_keyword.csv', delimiter=';').query('keyword_id != 0 and keyword_id != 1')
mak.head()

    keyword_id  article_id
38           2       31476
39           2       49574
40           2       50354
41           3       84739
42           3      227093

In [3]:
query1 = '''
    select
        keyword_id as id,
        article_id
    from mak
    where keyword_id in (
        select
            keyword_id
        from mak
        group by keyword_id
        having count(article_id) >= 1000
        )
'''

In [4]:
query2 = '''
    select
        a.keyword_id as id,
        article_id
    from mak as a join (
        select
            keyword_id
        from mak
        group by keyword_id
        having count(article_id) >= 1000
        ) as b
    on a.keyword_id = b.keyword_id
'''

In [5]:
%time d1 = ps.sqldf(query1, locals())
d1.head()

CPU times: user 40.8 s, sys: 1.68 s, total: 42.5 s
Wall time: 43.2 s

    id  article_id
0  136         519
1  136         551
2  136         788
3  136         826
4  136        1852

In [6]:
%time d2 = ps.sqldf(query2, locals())
d2.head()

CPU times: user 39.5 s, sys: 768 ms, total: 40.3 s
Wall time: 40.3 s

    id  article_id
0  136         519
1  136         551
2  136         788
3  136         826
4  136        1852